* Ionizing luminosity from a black body atmosphere
** DONE Dimensionless part
CLOSED: [2023-08-31 Thu 21:44]
- The photon flux at the stellar surface is proportional to the dimensionless integral
  \[
  \int_{x_0}^\infty 2 x^2 dx / (e^x - 1)
  \]
- Where x_0 = (1 Rydberg) / k T
- But we can approximate this by putting e^x - 1 \approx e^x, which is a pretty good approximation
  - Better than 2% for T < 40,000 K
- This means, we can do the integral analytically as 2 (2 + x_0 (2 + x_0)) exp(-x_0)
- Here we compare the results with Wolfram alpha exact solution (in terms of polylogarithms)
    
|     T |    x_0 | Error | Int_2(x_0) | Wolf alpha |       q_H |      Q_H |
|-------+-------+-------+----------+------------+----------+---------|
| 30000 | 5.263 | 1.005 |   0.4167 |   0.417613 | 3.558e23 | 7.02e48 |
| 31000 | 5.093 | 1.006 |   0.4681 |            | 4.410e23 | 8.70e48 |
| 32000 | 4.934 | 1.007 |   0.5213 |            | 5.402e23 | 1.07e49 |
| 33000 | 4.784 | 1.008 |   0.5763 |            | 6.549e23 | 1.29e49 |
| 34000 | 4.644 | 1.010 |   0.6321 |            | 7.856e23 | 1.55e49 |
| 35000 | 4.511 | 1.011 |   0.6894 |   0.692461 | 9.347e23 | 1.84e49 |
| 36000 | 4.386 | 1.013 |   0.7472 |            | 1.102e24 | 2.17e49 |
| 37000 | 4.267 | 1.014 |   0.8061 |            | 1.291e24 | 2.55e49 |
| 38000 | 4.155 | 1.016 |   0.8650 |            | 1.501e24 | 2.96e49 |
| 39000 | 4.048 | 1.018 |   0.9246 |            | 1.734e24 | 3.42e49 |
| 40000 | 3.947 | 1.020 |   0.9839 |   0.991449 | 1.991e24 | 3.93e49 |
#+TBLFM: $2=$Ryd $h $c / $k $1;f3::$3=exp($2) / (exp($2) - 1);f3::$4=2 (2 + $2 (2 + $2)) exp(-$2);f4::$6=$pi ($k $1)**3 $4 /  $c**2 $h**3 ; s4::$7=4 $pi (18 $Rsun)**2 $6 ; s3
** DONE Dimensional part
CLOSED: [2023-08-31 Thu 22:33]
- Ionizing photon rate: Q_H = 4 \pi^2 (k T)^3 R^2 Int_2(x_0) / c^2 h^3
- I calculate Q_H in the above table, assuming R = 18 Rsun
- This implies that we have 1.29e49 for the Teff = 33,000 K that I have been using
  - Which is more or less the same as in the WR atmosphere models
- But I have found that I was using the wrong wind parameters
  - The best model is the CMFGEN blanketed model, which has f=0.1 wind filling factor
    - Mdot = 2e-5, which comes from (10^-4.2 sqrt(0.1))
      - 4 times smaller than I had assumed
    - Teff = 32,700 K
    - Vwind = 710 km/s
  
